/*Language Control*/

/*Standard Apple strings*/
"Your changes will be lost if you don't save them." = "Vos modifications seront perdues si vous ne les enregistrez pas.";
"Save " = "Enregistrement de ";
"Revert " = "Revenir à ";
"Save..." = "Enregistrer...";
"Discard Changes" = "Éliminer les modifications";
"The location of the document \"%@\" cannot be determined." = "L’emplacement du document \"%@\" n’a pu être déterminé.";
"The document \"%@\" has been moved." = "Le document \"%@\" a été déplacé.";
"This document has been renamed to \"%@\"." = "Ce document a été renommé \"%@\".";
"File Error" = "Erreur de fichier";
"The recent document \"%@\" in folder \"%@\" is missing." = "Le document récent \"%@\" du dossier \"%@\" est manquant.";
"Couldn't save document." = "Impossible de sauvegarder le document.";
"You can save to another location." = "Vous pouvez enregistrer dans un autre emplacement.";
"Save" = "Enregistrer";
"Quit Anyway" = "Quitter quand même";
"Proceed" = "Procéder";
"Stop" = "Arrêter";
"Cancel" = "Annuler";
"Do you want to save the changes you made in the document \"%@\"?" = "Voulez-vous enregistrer les modifications apportées au document \"%@\" ?";
"Save changes to \"%@\"?" = "Enregistrer les modifications de  \"%@\" ?";
"You have unsaved documents." = "Certains documents n’ont pas été enregistrés.";
"Don't Save" = "Ne pas enregistrer";
"Review Unsaved" = "Revoir la version non enregistrée";
"Save As..." = "Enregistrer sous...";



" - Canvas Size" = " - Taille du Canevas";

"Defaults" = "Par Défaut";

"Error" = "Erreur";

"This procedure name has already been used - please choose another" = "Le nom de cette procédure est déjà utilisé - veuillez en choisir un autre";

"New Procedure" = "Nouvelle Procédure";

" - Procedures" = " - Procédures";

"param" = "param";

"Delete Procedure" = "Effacer la Procédure";

"Add" = "Ajouter";

"Go Back" = "Revenir";

"Delete Procedures" = "Effacer les Procédures";

"Remove" = "Effacer";

"This procedure name is also a function name - please choose another" = "Le nom de cette procédure est aussi le nom d'une fonction - veuillez en choisir un autre";

"Parameters: " = "Paramètres : ";

"Procedure: %@" = "Procédure : %@";

"Rename Parameter" = "Renommer le Paramètre";

"Export Text" = "Exporter le Texte";

"Save Anyway" = "Enregistrer quand même";

"Warning — Unapplied Procedures" = "Attention - des Procédures n'ont pas été appliquées";

/*Info Window Strings*/

"Hidden" = "Invisible";

"Pen Down" = "Crayon Baissé";

"Shown" = "Visible";

"Pen Up" = "Crayon Levé";


"Canvas Resize" = "Ajuster le Canevas";

"%@ - Graphics" = "%@ - Graphique";

/*Menu show/hide*/

"Hide Procedures" = "Masquer Procédures";

"Show Procedures" = "Afficher Procédures";

"Show Graphics" = "Afficher Graphique";

"Hide Graphics" = "Masquer Graphique";

"Show Trace" = "Afficher Trace";

"Hide Trace" = "Masquer Trace";

"Show Info" = "Afficher Info";

"Hide Info" = "Masquer Info";

/*Error messages*/

	"variable %@ undefined" = "La variable %@ n'est pas définie";
	"%@ is an invalid number" = "%@ est un nombre invalide";
	"unknown error" = "Erreur inconnue";
	"unexpected object %@" = "Objet %@ inattendu";
	"can't %@ %@" = "Je ne peux pas %@ %@";
	"unterminated list" = "Liste incomplète";
	"can't evaluate %@" = "Je ne peux évaluer %@";
	"unknown function %@" = "La fonction %@ est inconnue";
	"%@ is invalid input for %@" = "%@ est un paramètre invalide pour %@";
	"can't compare %@ and %@" = "Je ne peux pas comparer %@ et %@";
	"wrong number of inputs for %@" = "Le nombre de paramètres est incorrecte pour %@";
	"USAGE: DEFINE \"name [[params] [procedure body]]" = "Usage: DEFINIR \"nom [[paramètres] [corps de la procédure]]";
	"unknown proc - %@" = "La procédure %@ est inconnue";
	"ABORTED" = "Processus interrompu";
	"%@ needs a list of two numbers" = "%@ demande une liste de 2 nombres";
	"%@ needs a list of three numbers" = "%@ demande une liste de 3 nombres";
	"SETPEN needs a list containing a pen state and a colour number" = "FIXECRAYON demande une liste contenant l'état du crayon et le numéro de la couleur";
	"unexpected end of sentence" = "Fin de phrase inattendue";
	"An empty %@ is invalid input for %@" = "Un %@ vide est une entrée invalide pour %@";
	"%@ does not have enough items for %@ %@" = "%@ n'a pas assez d'éléments pour %@ %@";
	"A file is already open for reading" = "Le fichier est déjà ouvert en lecture";
	"A file is already open for writing" = "Le fichier est déjà ouvert en écriture";
	"File %@ doesn't exist" = "Le fichier %@ n'existe pas";
	"File %@ is a directory" = "Le fichier %@ est un dossier";
	"Can't open file %@ for reading" = "Je ne peux ouvrir le fichier %@ en lecture";
	"Can't open file %@ for writing" = "Je ne peux ouvrir le fichier %@ en écriture";
	"No file is open for reading" = "Aucun fichier n'est ouvert en lecture";
	"No file is open for writing" = "Aucun fichier n'est ouvert en écriture";
	"Error reading from file" = "Erreur en lisant dans le fichier";
	"Error writing to file" = "Erreur en écrivant dans le fichier";

	"PenDown" = "CrayonBaisse";
	"PenUp" = "CrayonLeve";
	"PENDOWN" = "CRAYONBAISSE";
	"PENUP" = "CRAYONLEVE";
	"integer" = "entier";
	"double" = "double";
	"string" = "chaine";
	"TRUE" = "VRAI";
	"FALSE" = "FAUX";
	"To" = "Pour";
	"procedure" = "procédure";
	"function" = "fonction";
	"true" = "vrai";
	"false" = "faux";
	"list" = "liste";
	"variable" ="variable";

/*Undo strings*/

"Canvas Resize" = "Taille du Canevas";
"Insert Result" = "Insérer Résultat";
"Rename Parameter" = "Renommer le Paramètre";
"Select Turtle Image" = "Sélectionner l'Image de la Tortue";
"Add Turtle Image" = "Ajouter l'Image de la Tortue";
"Change Fontface" = "Changer la Police";
"Edit Defaults" = "Paramètres d'Edition par Défaut";
"Syntax Colouration" = "Coloration Syntaxique";
"Font Size" = "Taille de la Police";
"Smooth Lines" = "Lisser les Lignes";
"Auto Indent" = "Indentation Automatique";
"Turtle Shadow" = "Ombre de la Tortue";
"Set Localisation" = "Localisation des Commandes";
"Turtle Defaults" = "Tortue par Défaut";
"Turtle Size" = "Taille de la Tortue";
"Turtle Transparency" = "Transparence de la Tortue";
"Delete Image" = "Effacer l'Image";

